Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The line break between the close-parenthesis and open-brace is optional.
ja: クローズパンテシスとオープンブレースの間の改行は任意です。

source: The line number.
ja: 何行目かの数字です。

source: The line which called ListLines is also removed from the line history, to prevent clutter.
ja: ListLinesを呼んでいた行も、ごちゃごちゃしないように、行履歴から削除しています。

source: The line with throw does not need to be physically contained by the Catch statement's body; it can be used by a called function.
ja: throwの行は、Catch文の本体に物理的に含まれる必要はない。

source: The lines are separated by a linefeed character.
ja: 行は改行文字で区切られる。

source: The link's HREF attribute.
ja: リンクのHREF属性です。

source: The link's ID attribute (a string) if it has one, otherwise the link's index (an integer).
ja: リンクにID属性がある場合は文字列、ない場合はリンクのインデックス（整数値）です。

source: The list below describes each option.
ja: 以下のリストでは、各オプションについて説明します。

source: The list-view control sends an LVN_ITEMACTIVATE notification message to the parent window when the user clicks an item.
ja: リスト・ビュー・コントロールは、ユーザーが項目をクリックすると、LVN_ITEMACTIVATE通知メッセージを親ウィンドウに送信します。

source: The list-view control sends an LVN_ITEMACTIVATE notification message to the parent window when the user double-clicks an item.
ja: リストビューコントロールは、ユーザーが項目をダブルクリックすると、親ウィンドウにLVN_ITEMACTIVATE通知メッセージを送信します。

source: The literal syntax for constructing an ad hoc object is still basically {name:
ja: アドホック・オブジェクトを構築するためのリテラル構文は、やはり基本的に{name:

source: The literal syntax for constructing an ad hoc object is still basically {name: value}, but since plain objects now only have "properties" and not "array elements", the rules have changed slightly for consistency with how properties are accessed in other contexts:
ja: アドホック・オブジェクトを構築するためのリテラル構文は、やはり基本的に{name: value}です。しかし、プレーンオブジェクトは現在「配列要素」ではなく「プロパティ」しか持たないため、他のコンテキストでプロパティにアクセスする方法との一貫性を保つために、ルールが少し変更されました：

source: The logon name of the user who launched this script.
ja: このスクリプトを起動したユーザーのログオン名。

source: The loop had zero iterations.
ja: ループの反復回数は0回でした。

source: The loop may optionally be followed by an Else statement, which is executed if Count is zero.
ja: ループの後には、Countがゼロの場合に実行されるElse文がオプションで付いていることがある。

source: The loop may optionally be followed by an Else statement, which is executed if no matching files or directories were found (i.e. the loop had zero iterations).
ja: ループの後にElse文が続くことがありますが、これは一致するファイルやディレクトリが見つからなかった場合に実行されます（つまり、ループの反復回数がゼロの場合）。

source: The loop may optionally be followed by an Else statement, which is executed if no registry items of the specified type were found (i.e. the loop had zero iterations).
ja: このループには、オプションでElse文が続くことがあり、指定されたタイプのレジストリ項目が見つからなかった場合（つまり、ループがゼロ回繰り返された場合）に実行されます。

source: The loop may optionally be followed by an Else statement, which is executed if the input file is empty or could not be found.
ja: ループの後には、入力ファイルが空であったり、見つからなかったりした場合に実行されるElse文がオプションで付いていることがあります。

source: The loop may optionally be followed by an Else statement, which is executed if the loop had zero iterations.
ja: ループの後にElse文が続くこともあり、ループの反復回数がゼロの場合に実行されます。

source: The loop statement is usually followed by a block, which is a collection of statements that form the body of the loop.
ja: ループ文の後には、通常、ループの本体を形成する文の集合体であるブロックが続きます。

source: The loop's condition (if it has one) is checked to see if it is satisfied.
ja: ループの条件（もしあれば）が満たされているかどうかをチェックします。

source: The loop's condition (if it has one) is checked to see if it is satisified.
ja: ループの条件（ある場合）が満たされているかどうかをチェックします。

source: The main advantage is that the window usually doesn't need to be active to receive these messages.
ja: 主な利点は、これらのメッセージを受信するためにウィンドウが通常アクティブである必要がないことです。

source: The main analog outputs of this device (uses multiple jacks in the case of surround sound).
ja: 本機の主なアナログ出力端子（サラウンド・サウンドの場合は複数の端子を使用）。

source: The main download has a filename like AutoHotkey_2.0_setup.exe.
ja: メインでダウンロードされるのは、AutoHotkey_2.0_setup.exeのようなファイル名です。

source: The main use for this directive is to increase the responsiveness of the keyboard's auto-repeat feature.
ja: このディレクティブの主な用途は、キーボードのオートリピート機能の応答性を高めることです。

source: The major version of the base file used must be the same as the version of the script to be compiled.
ja: 使用するベースファイルのメジャーバージョンは、コンパイルするスクリプトのバージョンと同じでなければならない。

source: The majority of scripts never need to deal with handles, as in most cases AutoHotkey takes care of loading the image from file and freeing it when it is no longer needed.
ja: ほとんどの場合、AutoHotkeyがファイルから画像を読み込み、不要になったら画像を解放します。

source: The mask key is sent automatically to prevent the Start menu or the active window's menu bar from activating at unexpected times.
ja: スタートメニューやアクティブウィンドウのメニューバーが予期せぬタイミングで起動しないように、マスクキーが自動送信されます。

source: The mask key may be sent in such cases to prevent a Win or Alt keyup from activating a menu.
ja: このような場合、WinやAltのキーアップでメニューが起動しないように、マスクキーを送信することがあります。

source: The match object's syntax has changed:
ja: マッチオブジェクトの構文が変更されました：

source: The matching behavior is determined by SetTitleMatchMode.
ja: マッチング動作は、SetTitleMatchModeによって決定されます。

source: The maximum allowed length of the input.
ja: 入力の最大許容長を示します。

source: The maximum for both parameters is 2147483647.
ja: 両パラメーターの最大値は2147483647である。

source: The maximum number of threads that can be launched for a given hotkey/hotstring subroutine (limit 255).
ja: 指定したホットキー/ホットストリングサブルーチンで起動できるスレッドの最大数（上限255）です。

source: The maximum number of bytes to read.
ja: 読み出す最大バイト数を指定します。

source: The maximum number of characters to read.
ja: 読み込む最大文字数を指定します。

source: The maximum number of columns in a ListView is 200.
ja: ListViewの最大列数は200列です。

source: The maximum number of elements the array should be able to contain before it must be automatically expanded.
ja: 配列が自動的に拡張されるまでの最大要素数を指定します。

source: The maximum number of ending characters is 100.
ja: エンディングキャラクターの最大文字数は100文字です。

source: The maximum number of hotkeys that can be pressed within the interval defined by A_HotkeyInterval without triggering a warning dialog.
ja: A_HotkeyIntervalで定義された間隔内に、警告ダイアログを表示せずに押せるホットキーの最大数。

source: The maximum number of hotkeys that can be pressed within the interval without triggering a warning dialog.
ja: 警告ダイアログをトリガーすることなく、間隔内に押せるホットキーの最大数。

source: The maximum number of key-value pairs the map should be able to contain before it must be automatically expanded.
ja: 自動的に拡張される前に、マップが含むことのできるキーと値のペアの最大数を指定します。

source: The maximum number of milliseconds to wait for the target window to process the message.
ja: ターゲットウィンドウがメッセージを処理するまでの最大待ち時間（ミリ秒）を指定します。

source: The maximum number of seconds to wait.
ja: 待機する最大秒数です。

source: The maximum total number of threads that can exist simultaneously.
ja: 同時に存在できるスレッドの最大総数です。

source: The maximum year considered valid is 9999.
ja: 有効な年号は最大9999年です。

source: The meaning of the Time parameter.
ja: Timeパラメータの意味。

source: The means by which icons are added to a ListView or TreeView control.
ja: リストビューや ツリービューコントロールにアイコンを追加するための手段。

source: The memory occupied by a large variable can be freed by setting it equal to nothing, e.g. var := "".
ja: 大きな変数が占有するメモリは、例えばvar := ""のように、何も設定しないことで解放できる。

source: The menu can also be optionally shown for unsupported window types, in which case the chosen favorite will be opened as a new Explorer window.
ja: このメニューはオプションで、サポートされていないウィンドウタイプにも表示することができ、その場合、選択したお気に入りは新しいエクスプローラーウィンドウとして開かれます。

source: The menu item's current callback or submenu is unchanged.
ja: メニューアイテムの現在のコールバックまたはサブメニューは変更されます。

source: The menu name parameters can also specify positions.
ja: メニュー名のパラメーターは、位置を指定することも可能です。

source: The message box is owned by a GUI window by means of the OwnDialogs option.
ja: メッセージボックスは、OwnDialogsオプションにより、GUIウィンドウに所有されます。

source: The message number to send.
ja: 送信するメッセージ番号です。

source: The message number, which is useful in cases where a function monitors more than one message.
ja: メッセージ番号。ある機能が複数のメッセージを監視している場合に便利です。

source: The message parameters.
ja: メッセージのパラメータです。

source: The message shown depends on the version of AutoHotkey interpreting the directive.
ja: 表示されるメッセージは、ディレクティブを解釈しているAutoHotkeyのバージョンに依存します。

source: The message to display.
ja: 表示するメッセージ。

source: The message's LPARAM value.
ja: メッセージのLPARAM値です。

source: The message's WPARAM value.
ja: メッセージのWPARAMの値です。

source: The message's parameters contain the control ID, HWND and notification code, which AutoHotkey uses to dispatch the notification to the appropriate callback.
ja: メッセージのパラメータには、コントロールID、HWND、通知コードが含まれ、AutoHotkeyはこれを使用して、適切なコールバックに通知をディスパッチします。

source: The meta-function is expected to handle cases such as x.y[z] where x.y is undefined.
ja: メタファンクションは、x.yが未定義のx.y[z]のようなケースを処理することが期待されます。

source: The method above also allows the sending of modifier keystrokes (Ctrl, Alt, Shift, and Win) while the workstation is locked (protected by logon prompt).
ja: 上記の方法では、ワークステーションがロックされている（ログオンプロンプトで保護されている）状態でも、修飾キーストローク（Ctrl、Alt、Shift、Win）を送信することができます。

source: The method definition below creates a property of the same type as target.DefineProp('Method', {call:
ja: 以下のメソッド定義では、target.DefineProp('Method', {call:

source: The method definition below creates a property of the same type as target.DefineProp('Method', {call: funcObj}).
ja: 以下のメソッド定義では、target.DefineProp('Method', {call: funcObj})と同じ型のプロパティを作成する。

source: The method name does not uniquely identify the function; instead, what happens when the method call is attempted depends on the object.
ja: メソッド名は関数を一意に特定するものではなく、メソッド呼び出しが試みられたときに何が起こるかは、オブジェクトに依存します。

source: The method name to check for.
ja: チェックするメソッド名です。

source: The methods of reading and writing clipboard file data are different.
ja: クリップボードファイルのデータを読み込む方法と書き込む方法は異なります。

source: The minimum and/or maximum number to be generated, specified in either order.
ja: 生成される最小数および／または最大数を、いずれかの順序で指定する。

source: The mixed Object type has been split into Object, Array and Map (associative array).
ja: 混在していたObject型は、Object、Array、Map（連想配列）に分割されました。

source: The modes above also affect ExcludeTitle in the same way as WinTitle.
ja: 上記のモードは、WinTitleと同様にExcludeTitleにも影響する。

source: The modifier combination <^>! corresponds to the AltGr key (if present on your keyboard layout), since the operating system implements it as a combination of LCtrl and RAlt.
ja: 修飾子の組み合わせ<^>!は、オペレーティングシステムが LCtrl と RAlt の組み合わせとして実装しているため、AltGr キー（キーボードレイアウトに存在する場合）に対応します。

source: The modifier is physically down or the hotkey requires the modifier to activate.
ja: モディファイアが物理的にダウンしているか、ホットキーがモディファイアの起動を要求している。

source: The monitor number, between 1 and the number returned by MonitorGetCount.
ja: モニター番号。1からMonitorGetCountによって返される番号の間。

source: The most common activity of a macro is to send simulated keystrokes and mouse clicks to one or more windows.
ja: マクロの最も一般的な動作は、1つまたは複数のウィンドウにシミュレートされたキーストロークや マウスクリックを送信することです。

source: The most common example is Explorer's tree of drives and folders.
ja: 最も一般的な例は、エクスプローラーのドライブとフォルダーのツリーである。

source: The most common example is LPDWORD, which is a pointer to a DWORD.
ja: 最も一般的な例はLPDWORDで、これはDWORDへのポインタです。

source: The most common form of dynamic variable reference is called a double reference or double-deref.
ja: 動的変数参照の最も一般的な形式は、二重参照またはdouble-derefと呼ばれます。

source: The most common modifiers are Ctrl (^), Alt (!), Shift (+) and Win (#).
ja: 一般的な修飾語は、Ctrl（^）、Alt（!）、Shift（+）、Win（#）です。

# The most common ones are (tab), (carriage return), and (linefeed).
source: The most common ones are \t (tab), \r (carriage return), and \n (linefeed).
ja: 最も一般的なのは、\t（タブ）、\r（キャリッジリターン）、\n（ラインフィード）。

source: The most common use for this feature is to change the hotkeys that are built into Windows itself.
ja: この機能の最も一般的な使い方は、ウィンドウズ自体に組み込まれているホットキーを変更することです。

source: The most common way assigning the return value of a function to a variable is like so:
ja: 関数の戻り値を変数に代入する最も一般的な方法は次のとおりです：

source: The most common way to define a hotkey is to write the hotkey name followed by double-colon, then the action:
ja: ホットキーを定義する最も一般的な方法は、ホットキー名の後にダブルコロン、そしてアクションを記述することです：

source: The most complex method works in the broadest variety of circumstances (such as games that require a key or mouse button to be held down).
ja: 最も複雑な方法は、（キーやマウスボタンを押し続ける必要があるゲームなど）最も幅広い状況で機能する。

source: The most recently executed hotkey or non-auto-replace hotstring (blank if none), e.g. #z.
ja: 最近実行したホットキーまたは自動置換でないホットストリング（ない場合は空白）。#zなど。

source: The mouse cursor will not move in response to the user's physical movement of the mouse (DirectInput applications are a possible exception).
ja: マウスカーソルは、ユーザーのマウスの物理的な動きに反応して動くことはありません（DirectInputアプリケーションは例外となる可能性があります）。

source: The mouse hook monitors mouse clicks for the purpose of activating mouse hotkeys and facilitating hotstrings.
ja: マウスフックは、マウスのホットキーを有効にし、ホットストリングを容易にする目的で、マウスのクリックを監視する。

source: The mouse hook will stay installed until the next use of the Suspend or Hotkey function, at which time it is removed if not required by any hotkeys or hotstrings (see #Hotstring NoMouse).
ja: マウスフックは、次にサスペンドまたはホットキー機能を使用するまで設置されたままとなり、ホットキーやホットストリングで必要とされない場合は、その時点で削除されます（#Hotstring NoMouseを参照）。

source: The mouse wheel (WheelUp/Down/Left/Right).
ja: マウスホイール（WheelUp/Down/Left/Right）。

source: The mysterious square brackets
ja: 謎の角括弧

source: The name (or a prefix of the name) of the top-level menu item, e.g. "File", "Edit", "View".
ja: 最上位メニューの名称（または名称の接頭語）、例："ファイル"、"編集"、"表示"。

source: The name (or a prefix of the name) of the top-level menu item, e.g. File, Edit, View.
ja: 最上位メニューの名称（または名称の接頭語）、例：ファイル、編集、表示。

source: The name and effect of each property or method depends on the specific object or type of object.
ja: 各プロパティやメソッドの名称や効果は、特定のオブジェクトやオブジェクトの種類に依存します。

source: The name is not case sensitive.
ja: 名前の大文字と小文字は区別されません。

source: The name is not case-sensitive.
ja: 名前の大文字と小文字は区別されません。

source: The name of a label.
ja: ラベルの名前です。

source: The name of a single file or a wildcard pattern such as "C:\Temp\*.tmp".
ja: 単一のファイル名、または "C:\Temp\*.tmp" のようなワイルドカードパターンを指定します。

source: The name of a single file or a wildcard pattern such as C:\Temp\*.tmp.
ja: 単一のファイル名、またはC:\Temp\*.tmp のようなワイルドカードパターンを指定します。

source: The name of a single file or folder, or a wildcard pattern such as "C:\Temp\*.tmp".
ja: 単一のファイルまたはフォルダーの名前、または "C:\Temp\*.tmp "のようなワイルドカードパターンを指定します。

source: The name of a single file or folder, or a wildcard pattern such as C:\Temp\*.tmp.
ja: 1つのファイルやフォルダの名前、またはC:\Temp\*.tmpのようなワイルドカードパターンです。

source: The name of a single file to be added to the compiled EXE.
ja: コンパイルされたEXEに追加される単一のファイル名。

source: The name of a subpattern.
ja: サブパターンの名前です。

source: The name of a window's process can be revealed via Window Spy.
ja: ウィンドウのプロセス名は、ウィンドウ・スパイ（Window Spy）を通じて知ることができる。

source: The name of an existing item or a position& between 1 and the current number of custom items plus 1 (following the same rules as MenuItemName).
ja: 既存のアイテムの名前、または1から現在のカスタムアイテムの数プラス1までの間の位置&（MenuItemNameと同じ規則に従う）。

source: The name of an icon (.ICO), cursor (.CUR), animated cursor (.ANI) file (animated cursors will not actually be animated when displayed in a ListView), or a bitmap or icon handle like "HBITMAP:" handle.
ja: アイコン（.ICO）、カーソル（.CUR）、アニメーションカーソル（.ANI）ファイル（アニメーションカーソルはリストビューに表示しても実際にはアニメーションしません）、または"HBITMAP: "ハンドルなどのビットマップまたはアイコンハンドルの名前です。

source: The name of the .ini file, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: .iniファイルの名前。絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されます。

source: The name of the environment variable to retrieve.
ja: 取得する環境変数名。

source: The name of the label to which to jump.
ja: ジャンプ先のラベルの名前です。

source: The name of the user-defined function that is currently executing (blank if none); for example:
ja: 現在実行中のユーザー定義関数の名前（ない場合は空白）：

source: The name of the user-defined function that is currently executing (blank if none); for example: MyFunction.
ja: 現在実行中のユーザー定義関数の名前（ない場合は空白）、事例：MyFunction。

source: The name of the computer as seen on the network.
ja: ネットワーク上で見られるコンピュータの名前。

source: The name of the default menu item, or an empty string if there is no default.
ja: デフォルトのメニュー項目の名前、またはデフォルトがない場合は空の文字列を指定します。

source: The name of the device or component, which can be empty.
ja: デバイスまたはコンポーネントの名前。

source: The name of the environment variable, e.g. "Path".
ja: 環境変数の名前です、例："Path"。

source: The name of the event.
ja: イベントの名前です。

source: The name of the file or folder currently retrieved (without the path).
ja: 現在取得されているファイルまたはフォルダの名前（パスなし）です。

source: The name of the file to be appended, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されます。

source: The name of the file to be kept open for the duration of the loop, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: ループの間、開いておくファイルの名前。絶対パスが指定されていない場合は、A_WorkingDirにあると仮定される。

source: The name of the file to be played, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合は、A_WorkingDirにあるとみなされる。

source: The name of the file to read, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されます。

source: The name of the group as originally defined by GroupAdd.
ja: GroupAddで元々定義されているグループ名。

source: The name of the group to activate, as originally defined by GroupAdd.
ja: GroupAddで定義された、アクティブ化するグループの名前。

source: The name of the group to which to add this window specification.
ja: このウィンドウ仕様を追加するグループの名前。

source: The name of the joystick or its driver.
ja: ジョイスティックまたはそのドライバの名前。

source: The name of the last key which was pressed prior to the most recent key-press or key-release, or blank if no applicable key-press can be found in the key history.
ja: キー履歴に該当するキーがない場合は空白。

source: The name of the menu item to select or its position (see above).
ja: 選択するメニュー項目の名前またはその位置（上記参照）。

source: The name of the menu item to select or its position.
ja: 選択するメニュー項目の名前またはその位置。

source: The name of the method to retrieve.
ja: 取得するメソッド名。

source: The name of the new working directory, which is assumed to be a subfolder of the current A_WorkingDir if an absolute path isn't specified.
ja: 絶対パスが指定されていないときは、新しい作業ディレクトリは現在のA_WorkingDirのサブフォルダとみなされます。

source: The name of the object's default interface.
ja: オブジェクトのデフォルトインターフェイスの名前。

source: The name of the property or method.
ja: プロパティまたはメソッドの名前です。

source: The name of the property to change.
ja: 変更するプロパティの名前。

source: The name of the property.
ja: プロパティの名前です。

source: The name of the target file or folder, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合は、A_WorkingDirにあると仮定される、ターゲットファイルまたはフォルダの名前。

source: The name of the target file, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されるターゲットファイル名。

source: The name of the target file.
ja: 対象ファイル名。

source: The name of the target group, as originally defined by GroupAdd.
ja: GroupAddで元々定義されている対象グループの名前です。

source: The name of the text file whose contents will be read by the loop, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されます。

source: The name of the value that will be written to.
ja: 書き込まれる値の名前です。

source: The name of the value to delete.
ja: 削除する値の名前。

source: The name of the value to retrieve.
ja: 取得する値の名前。

source: The name of the variable (with or without the leading U_) to receive the result.
ja: 結果を受け取る変数名（先頭のU_はあってもなくてもよい）。

source: The name of the variable (with or without the leading U_).
ja: 変数名（先頭のU_はあってもなくてもよい）。

source: The name of this file depends on the filename of the current executable.
ja: このファイルの名前は、現在の実行ファイルのファイル名に依存します。

source: The name or pattern of the destination, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合は、A_WorkingDirにあると仮定される、保存先の名前またはパターン。

source: The name or position of a menu item.
ja: メニュー項目の名称や位置。

source: The names of controls should always match those shown by the Window Spy.
ja: コントロールの名前は、常にWindow Spyが表示する名前と一致する必要があります。

source: The names of menu items can be up to 260 characters long.
ja: メニュー項目の名称は260文字まで可能です。

source: The names of the buttons can be customized by following this example.
ja: ボタンの名称は、この例に従ってカスタマイズすることができます。

source: The names of the letter and number keys are the same as that single letter or digit.
ja: 文字キーと数字キーの名前は、その単一の文字または数字と同じです。

source: The native encoding depends on the version of AutoHotkey:
ja: ネイティブエンコードは、AutoHotkeyのバージョンによって異なります：

source: The nature of these values is defined by the enumerator, which is determined by Expression.
ja: これらの値の性質は、Expressionによって決定される列挙子によって定義されます。

source: The nested class is not instantiated automatically, nor do instances of the nested class have any connection with an instance of the outer class, unless the script explicitly makes that connection.
ja: ネストされたクラスは自動的にインスタンス化されないし、ネストされたクラスのインスタンスは、スクリプトが明示的にその接続を行わない限り、アウター・クラスのインスタンスとの接続を持たない。

source: The new "fat arrow" => operator can also be used to create nested functions.
ja: また、新しい「太矢印」=>演算子を使って、ネストした関数を作成することができます。

source: The new is operator such as in x is y can be used to check whether value x is an instance of class y, where y must be an Object with a prototype property (i.e. a Class).
ja: x is yのような 新しいis演算子は、値xがクラスyのインスタンスであるかどうかを確認するために使用されます（yはプロトタイププロパティを持つオブジェクト（すなわちクラス）でなければなりません）。

source: The new HRESULT return type throws an exception if the function failed (int < 0 or uint & 0x80000000).
ja: 新しいHRESULTの戻り値は、関数が失敗した場合（int < 0またはuint & 0x80000000）、例外をスローするものです。

source: The new behaviour is as follows:
ja: 新しい動作は以下の通りです：

source: The new capacity.
ja: 新しい容量です。

source: The new column header.
ja: 新しいカラムヘッダーです。

source: The new column's attributes -- such as whether or not it uses integer sorting -- always start off at their defaults unless changed via Options.
ja: 新しいカラムの属性 (integer sorting を使用するかどうかなど) は、Optionsで変更しない限り、常にデフォルト値で始まります。

source: The new columns of the specified row, which can be text or numeric (including numeric expression results).
ja: 指定された行の新しい列。テキストまたは数値（数値式の結果を含む）を指定することができる。

source: The new label to set.
ja: 設定する新しいラベルです。

source: The new name of the item.
ja: アイテムの新しい名前。

source: The new name.
ja: 新しい名前です。

source: The new path and name of the directory (with no trailing baskslash), which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合、A_WorkingDirにあると仮定されるディレクトリの新しいパスと名前（末尾にバスクラッシュを付けない）。

source: The new position, in screen coordinates.
ja: 新しい位置（スクリーン座標）。

source: The new position, relative to the GUI window's client area, which is the area not including title bar, menu bar, and borders.
ja: GUIウィンドウのクライアント領域（タイトルバー、メニューバー、ボーダーを含まない領域）に対する相対的な新しい位置。

source: The new search strategy is the same as if Directory was passed to the system's function SetDllDirectoryW.
ja: 新しい検索戦略は、Directoryが、システムの関数SetDllDirectoryWに渡された場合と同じです。

source: The new size.
ja: 新しいサイズです。

source: The new style value is calculated as shown below (where CurrentStyle could be retrieved with ControlGetStyle/ControlGetExStyle or WinGetStyle/WinGetExStyle):
ja: 新しいスタイル値は以下のように計算されます（CurrentStyleは ControlGetStyle/ControlGetExStyleまたはWinGetStyle/WinGetExStyleで取得することができます）。

source: The new style value is calculated as shown below (where CurrentStyle could be retrieved with ControlGetStyle, ControlGetExStyle, WinGetStyle or WinGetExStyle):
ja: 新しいスタイル値は次のように計算されます（CurrentStyleはControlGetStyle、ControlGetExStyle、WinGetStyleまたはWinGetExStyleで取得できます）：

source: The new style value is calculated as shown below (where CurrentStyle could be retrieved with WinGetStyle or WinGetExStyle):
ja: 新しいスタイル値は、次に示すように計算されます。CurrentStyle はWinGetStyleまたはWinGetExStyleで取得できます：

source: The new style value is calculated as shown below (where CurrentStyle could be retrieved with WinGetStyle/WinGetExStyle):
ja: 新しいスタイル値は以下のように計算されます（CurrentStyleはWinGetStyle/WinGetExStyleで取得できます）：

source: The new text to set into the control.
ja: コントロールに設定する新しいテキストです。
